#Простой Калькулятор
#Чтобы открыть его надо открыть консоль и добраться до него 
#Я это скомпилировал можешь посмотреть 
#Это я отдельно скачал мод для консоли называеться PIP
from colorama import init 
from colorama import Fore, Back, Style
# Fore это шрифт всего текста
# Back это то что красит весь текст в цвета 
# Без этого инита он выдаст ошибку и хуй что у тебя откроеться 
init()

print( Fore.BLACK )
print( Back.GREEN )
# Он покрашен в ЗЕЛЕНЫЙ ЦВЕТ
what = input("Что делаем? (+, -):")

print( Back.CYAN )
# А это все покрашено в СИНИЙ цвет то есть CYAN P.S не прям в синий а морской цвет
a = float( input("Введи первое число: ") )
b = float( input("Введи второе число: ") )

print( Back.YELLOW )
# Это уже ответ и он покрашен в Оранжевый цвет
if what == "+":
	c = a + b
	print("Результат: " + str(c))
elif what == "-":
	c = a - b
	print("Результат: " + str(c))
else: 
	print("Выбрана неверная операция! ")
# Это не дает ему сразу закрыться 
input()